Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་གཞོག་པའི་ཚིག་གོ། །
en: It is a recitation of dhyāna, liberation, samādhi, and samāpatti.

source: ཆོས་ཐམས་ཅད་ལ་འཇུག་པར་བྱེད་པའི་ཚིག་གོ། །
en: It is a recitation of entry into all Dharmas.

source: རྟག་ཏུ་ལྷ་རྣམས་འདོད་པར་བྱེད་པའི་ཚིག་གོ།
en: It is a recitation continuously yearned for by the devas.

source: རིགས་ཀྱི་བུ་གང་ཐར་བར་འདོད་པ་གནས་སྣ་ཚོགས་སུ་རབ་ཏུ་བྱུང་བ། བགོ་བ་སྣ་ཚོགས་སུ་རབ་ཏུ་འབྱུང་བ་
en: “Noble son, people are ordained in various orders and are ordained in the various garments of those seeking liberation,

source: དབང་པོའི་བགོ་བ་དང་། དཀར་པོའི་བགོ་བ་དང་། བསྟེན་པའི་བགོ་བ་སྟེ། །
en: rainbow-colored garments, white garments, and pure white garments.

source: ཉི་མ་བརྟགས་ནས་དབང་ཕྱུག་ཆེན་པོ་ལ་རབ་ཏུ་འབྱུང་ངོ་། །
en: They are ordained into those who stare at the sun, the followers of Maheśvara,

source: འཇུག་སྲེད་དང་། ནམ་མཁའ་ལྡིང་དང་། གཅེར་བུ་པ་དང་། རི་མི་དང་། གནས་དེ་དག་ཏུ་རབ་ཏུ་འབྱུང་སྟེ་
en: the followers of Viṣṇu and Garuḍa , and naked ascetics. They take ordination in those orders, but

source: དེ་དག་ལ་ཡང་ཐར་པ་མེད་དོ། །
en: but those deities do not bring liberation;

source: མགོན་ཡང་མ་ཡིན། །
en: they are not protectors,

source: བརྟུལ་ཞུགས་ཅན་ཡང་མ་ཡིན་ནོ། །
en: nor is theirs the conduct that is to be followed.

source: ལྷ་མང་པོ་དང་། ཚངས་པ་དང་། འཇུག་སྲེད་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། བརྒྱ་བྱིན་ལྷའི་དབང་པོ་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། རླུང་གི་ལྷ་དང་། ཆུའི་ལྷ་དང་། མེའི་ལྷ་དང་། ཆོས་ཀྱི་རྒྱལ་པོ་གཤིན་རྗེ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་རྟག་ཏུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་སློང་ངོ་། །
en: All the hosts of deities—Brahmā, Viṣṇu, Maheśvara, Śakra, who is the lord of devas, Āditya, Candra, Vāyu, Varuṇa, Agni, Dharmarāja Yama, and the four mahārājas—constantly request the six-syllable queen of mahāvidyās.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་བདག་ཅག་གིས་ཐོབ་པར་འགྱུར། ཐར་པ་ལ་གཞོལ་བར་འགྱུར།
en: “Bhagavat, how can we obtain the six-syllable queen of mahāvidyās, so that we can dedicate ourselves to liberation?”

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་འདི་ལྟ་སྟེ།
en: “Sarva­nīvaraṇa­viṣkambhin, it is like this:

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱེད་པར་གྲགས་པ་སྟེ།
en: Prajñāpāramitā is known to be the one who gave birth to all the tathāgatas.

source: དེ་ཡང་ཐལ་མོ་སྦྱར་ནས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་ལ་ཕྱག་འཚལ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་དང་བཅས་པ་ལྟ་ཅི་སྨོས།
en: Even she places her palms together and pays homage to the six-syllable queen of mahāvidyās, let alone the tathāgatas, arhats, samyaksaṃbuddhas, and the hosts of bodhisattvas.

source: རིགས་ཀྱི་བུ་འདི་ནི་འབྲས་ལྟ་བུར་སྙིང་པོར་གྱུར་པ་ཡིན་ཏེ། །
en: “Noble son, this is an essence, like rice.

source: རིགས་ཀྱི་བུ་འདི་ལ་ཆུང་ཟད་བཟླས་པས་ཀྱང་ཐེག་པ་ཆེན་པོའི་རྣམ་པ་མང་པོ་མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། རྟོགས་པ་བརྗོད་པ་དང་། འདི་ལྟ་བུ་འདས་པ་དང་སྐྱེས་པའི་རབས་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། ཆོས་རྨད་དུ་བྱུང་བ་དང་། གཏན་ལ་ཕབ་བ་བསྟན་པ་དང་། ཞི་བ་དང་། ཐར་པ་ཡང་ཐོབ་པར་འགྱུར་རོ།
en: Noble son, through this you can obtain anything from within the Mahāyāna: many Mahāyāna sūtras, the geyas, the vyākaraṇas, the gāthās, the udānas, the nidānas, the avadānas, the itivṛttakas, the jātakas, the vaipulyas, the adbhūtadharmas, and the upadeśas. Simply repeating it will bring peace and liberation.

source: མང་དུ་བཤད་ཅི་དགོས་ཏེ་གཞན་མ་བྱེད་ཅིག །
en: Why say more about its other virtues?

source: སའི་ནང་དུ་གཏོགས་པ་ལ་སྙིང་པོར་འཛིན་པ་ཅི་ཡིན་ཞེ་ན།
en: “What does it mean that it is conceived of as a central essence?

source: དེ་ལྟར་འབྲས་ནི་སྙིང་པོར་འཛིན་ཏེ། །
en: It can be conceived of as being like the essence of rice.

source: ཁྱེར་ནས་བདག་གི་ཁྱིམ་དུ་སྣོད་རྣམས་ཡོངས་སུ་བཀང་སྟེ་འཇོག་གོ། །བཞག་ནས་
en: We take it home and fill our pots with rice and keep it in there.

source: ཉི་མའི་ཚུལ་བཞིན་དུ་ཉི་མ་ཚ་བ་ལ་སྐེམས་སོ། །
en: in accord with the sun, we dry it in the sun’s heat.

source: བསྐམས་ནས་གཏུན་ལ་བརྡུངས་ཤིང་ཕུབ་མ་རྣམས་སེལ་ཏོ།
en: When it is dried, we pound it with a pestle to remove the chaff.

source: དེའི་སྙིང་པོ་ནི་འབྲས་རྨེའུ་ཡིན་ནོ་
en: What is the essence? The essence is the rice.

source: དེ་བཞིན་དུ་རྣལ་འབྱོར་གཞན་དག་ཕུབ་མ་དང་འདྲའོ། །
en: In that way, all other yogas are like husks,

source: རྣལ་འབྱོར་ཐམས་ཅད་ཀྱི་ནང་ན་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་འདི་ནི་འབྲས་རྨེའུར་གྱུར་པའོ།
en: and from among all yogas, the six-syllable queen of mahāvidyās is like the rice.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱིར། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱིར། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱིར། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱིར། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱིར་
en: so as to have the perfection of generosity, the perfection of conduct, the perfection of patience, the perfection of diligence, the perfection of meditation, and the perfection of wisdom.

source: རིགས་ཀྱི་བུ་བཟླས་པ་གཅིག་བྱས་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Noble son, one repetition of the mahāvidyā completes the six perfections.

source: ལ་ལ་ཞིག་གིས་ལག་པས་རེག་པས་རེག་ན་དེ་དག་ཀྱང་ཕྱིར་མི་ལྡོག་པའི་ས་འཐོབ་པར་འགྱུར་རོ། །
en: Those who just touch it with their clothes will attain the level of irreversibility.

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་འདི་ཡང་དེ་ལྟ་བུ་སྟེ། །
en: Noble son, that is what the six-syllable queen of mahāvidyās is like.

source: དེའི་མིང་འཛིན་པ་ཡང་དཀོན་ནོ། །
en: Those who recite that name are rare.

source: མིང་ལན་ཅིག་བཟུང་ན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ན་བཟའ་དང་། བཤོས་དང་། མལ་སྟན་དང་། ན་བའི་རྐྱེན་གྱི་སྨན་གྱི་ཡོ་བྱད་དང་། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བཀུར་སྟིར་བྱས་པར་འགྱུར་རོ།
en: Possessing its name just once will make them equal to someone who has provided all the tathāgatas with all requisites: with robes, food, bowls, bedding, seats, necessary medicine, and utensils.”

source: དེ་ནས་ཆོས་སྨྲ་བ་དེ་ལ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སལ་བས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Sarva­nīvaraṇa­viṣkambhin then said to the dharmabhāṇaka,

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་བདག་ལ་སྩོལ་ཅིག །
en: Give me the six-syllable queen of mahāvidyās!

source: དེ་ནས་ཆོས་ཀྱི་མཁན་པོ་དེ་སེམས་ཤིང་འདུག་པ་ལས་དེ་ལ་ནམ་མཁའ་ལས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་བྱིན་ཅིག་ཅེས་སྒྲ་བྱུང་ངོ་། །
en: The dharmabhāṇaka thought and thought about this. Then a voice came from the sky saying, “Give him the six-syllable queen of mahāvidyās!”

source: དེ་ནས་ཆོས་སྨྲ་བ་དེ་སྒྲ་ག་ལས་བྱུང་ཞེས་བསམས་པ་དང་།
en: The dharmabhāṇaka wondered where this voice had come from.

source: དེ་ནས་ཡང་ནམ་མཁའ་ལས་བྱང་ཆུབ་སེམས་དཔའ་འདིས་དཀའ་བ་སྤྱོད་པ་དུ་མ་ལ་བརྩོན་པར་བྱས་ཀྱིས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་བྱིན་ཅིག་ཅེས་སྒྲ་བྱུང་ངོ་། །
en: Again there came the voice from the sky, saying, “This bodhisattva has undergone many hardships. Give him the six-syllable queen of mahāvidyās!”

source: དེ་ནས་ཆོས་སྨྲ་བ་དེས་ནམ་མཁའ་ལ་བལྟས་པ་དང་།
en: The dharmabhāṇaka looked up into the sky and

source: འདམ་བུའི་མདའ་བཞིན་དུ་ཁ་དོག་དཀར་བ། རལ་བའི་ཅོད་པན་འཆང་བ། ཐམས་ཅད་མཁྱེན་པ་མགོ་ལ་བཞག་པ། ལག་པ་ན་མེ་ཏོག་པད་མ་བཟང་པོ་ཐོགས་པ། པད་མའི་དཔལ་གྱིས་བརྒྱན་པ་དེ་འདྲ་བའི་གཟུགས་མཐོང་ནས།
en: saw someone who had a body white as the autumn moon, a crown of coiled hair, an omniscient buddha upon his head, and a beautiful lotus in his hand, and was adorned with the splendor of lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་ཁྱོད་ལ་སྦྱིན་པར་གནང་ངོ་
en: “Noble son, the Bodhisattva Mahāsattva Avalokiteśvara has given permission for the six-syllable queen of mahāvidyās to be given to you.”

source: གུས་ཤིང་ཐལ་མོ་སྦྱར་ཏེ་ལེན་པར་རྩོམ་མོ།
en: Then Sarva­nīvaraṇa­viṣkambhin reverently placed his palms together to receive it.

source: ཨོཾ་མ་ཎི་པད་མེ་ཧཱུཾ།
en: Oṁ maṇipadme hūṁ

source: འདི་བྱིན་མ་ཐག་ཏུ་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ།
en: As soon as this was given, the earth shook in six ways.

source: ཏིང་ངེ་འཛིན་འདི་དག་ཀྱང་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་ཐོབ་སྟེ།
en: Sarva­nīvaraṇa­viṣkambhin attained these samādhis:

source: མི་ཟད་པའི་ཆོས་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Unceasing True Nature,

source: བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Love, Compassion, and Rejoicing,

source: རྣལ་འབྱོར་སྤྱོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Practicing Yoga,

source: ཐར་པ་ལ་འཇུག་པར་འཇོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Established in the Entry to Liberation,

source: ཐམས་ཅད་སྣང་བར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Illuminating Everywhere,

source: བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named The King of Arrays,

source: ཆོས་འཛིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: and the samādhi named Holding the Dharma.

source: ཏིང་ངེ་འཛིན་དེ་དག་ཐོབ་བོ།
en: Those are the samādhis he attained.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་བླངས་མ་ཐག་ཏུ་མཁན་པོ་ལ་ཡོན་དུ་གླིང་བཞི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་གང་བ་འབུལ་བར་རྩོམ་པ་དང་། །
en: As soon as Bodhisattva Mahāsattva Sarva­nīvaraṇa­viṣkambhin had obtained the six-syllable queen of mahāvidyās, he offered the four continents, completely filled with the seven jewels, as payment to that upādhyāya.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་བླངས་མ་ཐག་ཏུ་མཁན་པོ་ལ་ཡོན་དུ་གླིང་བཞི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་གང་བ་འབུལ་བར་རྩོམ་པ་དང་།
en: As soon as Bodhisattva Mahāsattva Sarva­nīvaraṇa­viṣkambhin had obtained the six-syllable queen of mahāvidyās, he offered the four continents, completely filled with the seven jewels, as payment to that upādhyāya.

source: དེ་ནས་ཆོས་ཀྱི་མཁན་པོ་དེས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: the dharmabhāṇaka said

source: ཡི་གེ་གཅིག་གི་ཡོན་དུ་ཡང་མེད་ན་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་ལྟ་ཅི་སྨོས།
en: “There is no payment required for even one of the syllables, let alone the six syllables of the mahāvidyā, nor will I take anything from you,

source: རིགས་ཀྱི་བུ་ང་ནི་ཁྱོད་ལས་ལེན་པ་ཡང་མེད་དོ། །ཁྱོད་ཀྱང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་སྟེ། ཁྱོད་ནི་འཕགས་པ་ཡིན་གྱི་མ་འཕགས་པ་མ་ཡིན། རིགས་ཀྱི་བུ་ཁྱོད་ནི་ངས་འདུལ་བ་ཡིན་ནོ། །
en: noble son. You are a bodhisattva, a noble being, with no one higher, and you are my pupil, noble son.”

source: དེས་དེ་ལ་མུ་ཏིག་གི་ཕྲེང་བ་རིན་བརྒྱ་སྟོང་རི་བ་ཕུལ་བ་དང་། དེས་སྨྲས་པ།
en: The dharmabhāṇaka presented him with a string of pearls to the value of a hundred thousand silver coins and said,

source: རིགས་ཀྱི་བུ་ངའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་ཕུལ་ཅིག །
en: “Noble son, in accord with my instruction, present this to the Tathāgata, the arhat, the samyaksaṃbuddha Śākyamuni.”

source: དེ་ནས་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་ཆོས་སྨྲ་བ་དེའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་སོང་ངོ་།
en: Sarva­nīvaraṇa­viṣkambhin bowed his head to the feet of the dharmabhāṇaka and departed,

source: རྙེད་པར་བྱ་བ་རྙེད་ཅིང་བསམ་པ་ཡོངས་སུ་རྫོགས་ནས་
en: having obtained what he sought and with his wishes fulfilled.

source: ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: He went to the Jetavana Monastery, arrived there,

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཞབས་ལ་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: bowed down to the feet of Bhagavat Śākyamuni, and sat to one side.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then the Bhagavat, the tathāgata, the arhat, the Samyaksaṃbuddha Śākyamuni asked,

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་རྙེད་པ་རྙེད་དམ། །
en: “Noble son, did you find what you sought?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་ཏེ། ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་པ་བཞིན་ནོ། །
en: “Bhagavat, it happened, as the Bhagavat knows.”

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་བདུན་ཚོགས་ཏེ།
en: Seventy-seven times ten million samyaksaṃbuddhas gathered there,

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་གཟུངས་སྔགས་འདི་གསུངས་སོ།
en: and those tathāgatas recited this dhāraṇī:

source: ན་མཿ་སབ་ཏཱ་ནཱཾ། སཾ་མྱག་སཾ་བུད་དྷ་ཀོ་ཊཱཾ་ནཱཾ། ཏད་ཡ་ཐཱ། ཨོ་ཙ་ལེ་ཙུ་ལེ་ཙུ་ན་དེ་སྭཱཧཱ། །
en: Namaḥ saptanām saṃyak­saṃbuddha­koṭinām tadyathā Oṁ cale cule cunde svāhā . [The homage by seven times ten million samyaksaṃbuddhas is like this: Oṁ cale cule cunde svāhā

source: གཟུངས་སྔགས་འདི་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་བདུན་གྱིས་གསུངས་སོ། །
en: That was the dhāraṇī recited by seventy-seven times ten million samyaksaṃbuddhas.

source: བ་སྤུའི་ཁུང་བུ་དེ་འདས་ནས་ཉི་མའི་འོད་ཅེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་གནས་ཏེ།
en: “Beyond that pore there is the pore named Sūryaprabha, in which many millions of trillions of bodhisattvas dwell.

source: ཉི་མའི་འོད་ཅེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་གསེར་གྱི་རི་ཁྲི་ཡོད་དེ། །
en: Within that pore named Sūryaprabha there are ten thousand mountains of gold.

source: རི་རེ་རེ་ཞིང་ཡང་རྩེ་མོ་ཉི་ཁྲི་ཉིས་སྟོང་ཡོད་ལ།
en: Each mountain has ,000 peaks.

source: རི་དེ་རེ་རེའི་ངོས་ནི་རིན་པོ་ཆེ་པད་མ་རཱ་གས་བརྒྱན།
en: Rubies adorn the sides of each mountain.

source: ངོས་རེ་རེ་ཞིང་ཡང་ལྷའི་ནོར་བུ་རིན་པོ་ཆེའི་སྐྱེད་མོས་ཚལ་ཤིན་ཏུ་མཛེས་པ། ཤིན་ཏུ་དགའ་བར་བྱེད་པ་རྣམ་པ་སྣ་ཚོགས་དང་ལྷའི་རྫིང་བུས་བརྒྱན་པ།
en: On the sides there are extremely beautiful gardens with divine precious jewels and adorned with many very beautiful and delightful walkways and bathing pools.

source: ཁང་པ་བརྩེགས་མ་བརྒྱ་ཕྲག་སྟོང་དུ་མ་ནི་ལྷའི་གསེར་དང་རིན་པོ་ཆེ་ལས་བྱས་ཤིང་
en: There are many hundreds of thousands of many-storied palaces made of divine gold and jewels.

source: མུ་ཏིག་དང་དར་གྱི་ལྡ་ལྡི་ནི་བྲེས། མུ་ཏིག་གི་སེ་མོ་དོ་བརྒྱ་དག་ནི་འཕྱང་ངོ་།
en: They are decorated with braided lengths of strings of pearls and silk, and they are hung with hundreds of strings of pearls.

source: ཁང་པ་བརྩེགས་མ་དེའི་ནང་ན་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ཤ་རི་ད་ཀ་ཡོད་པས་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱེད་དོ།
en: “Within each of the many-storied palaces there is a precious wish-granting jewel named Śārada, that provides each bodhisattva with everything he needs.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཁང་པ་བརྩེགས་མ་དེར་འགྲོའོ། །
en: “When those bodhisattvas have entered their many-storied palaces,

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱང་རྗེས་སུ་དྲན་ནོ། །
en: they remember the six-syllable mahāvidyā.

source: གང་གི་ཚེ་ན་རྗེས་སུ་དྲན་པ་དེའི་ཚེ་མྱ་ངན་ལས་འདའ་བ་རྟོགས་པར་འགྱུར་རོ། །
en: When they remember it, they realize nirvāṇa.

source: མྱ་ངན་ལས་འདའ་བའི་ས་དེ་ལ་དེ་བཞིན་གཤེགས་པ་བདུན་མཐོང་ངོ་། །
en: They see the seven tathāgatas that are at the level of nirvāṇa.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དེ་ཡང་མཐོང་ངོ་། །
en: They also see Bodhisattva Mahāsattva Avalokiteśvara.

source: མཐོང་ནས་ཀྱང་སེམས་དད་པ་སྐྱེད་དོ། །
en: When they see him, faith arises in their minds.

source: བསྐྱེད་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཁང་པ་བརྩེགས་མ་དེ་ནས་འབྱུང་ངོ་།
en: After that has occurred, the bodhisattvas leave the many-storied palaces.

source: བྱུང་ནས་ཁ་ཅིག་ནི་འཆག་སར་འགྲོའོ། །
en: Then some go to their walkways;

source: ཁ་ཅིག་ནི་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེའི་སྐྱེད་མོས་ཚལ་དུ་འགྲོའོ། །
en: some go to the gardens of precious wish-granting jewels;

source: ཁ་ཅིག་ནི་རྫིང་བུ་དག་ཏུ་འགྲོའོ། །
en: some go to the bathing pools;

source: ཁ་ཅིག་ནི་ནོར་བུ་རིན་པོ་ཆེ་པད་མ་རཱ་གའི་རིའི་ངོས་ལ་འགྲོའོ། །
en: and some go to the sides of the mountains, which are made of precious ruby jewels.

source: དོང་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས།
en: “When they arrive there, they sit cross-legged,

source: ལུས་དྲང་པོར་བསྲང་སྟེ་དྲན་པ་མངོན་པར་བཞག་ནས་འཁོད་དོ། །
en: sitting up straight, and establish themselves in focused mindfulness.

source: རིགས་ཀྱི་བུ་བ་སྤུའི་ཁུང་བུ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུ་དག་གནས་སོ།
en: Noble son, such are the bodhisattvas who live in that pore.

source: རིགས་ཀྱི་བུ་དེ་འདས་ནས་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་བརྒྱ་ཕྲག་སྟོང་དུ་མ་གནས་ཏེ།
en: “Beyond that there is the pore named Indrarāja, in which many millions of trillions of irreversible bodhisattvas dwell.

source: དབང་པོའི་རྒྱལ་པོའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་ལྷའི་གསེར་གྱི་རི་བརྒྱད་ཁྲི་ཡོད་དོ། །
en: Within that pore named Indrarāja there are eighty thousand mountains made of divine gold and jewels.

source: རི་དེ་དག་གི་དབུས་ན་ནོར་བུ་རིན་པོ་ཆེ་མེ་ཏོག་པད་མ་ལྟར་སྣང་བ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: In the middle of those mountains there is a precious jewel named Padmāvabhāsa.

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སེམས་པར་གྱུར་པ་དེའི་ཚེ་དེ་དག་གི་བསམ་པ་གྲུབ་པར་འགྱུར་རོ། །
en: It fulfills whatever wishes the bodhisattvas make.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་རིའི་རྒྱལ་པོ་དེ་ལ་གནས་ཤིང་ཟས་དང་སྐོམ་གྱི་དྲན་པ་མི་སྒོམ་མོ།
en: “In that way those bodhisattvas live on these kings of mountains without thinking about food or drink.

source: དེ་དག་འཁོར་བའི་སྡུག་བསྔལ་གྱིས་གཟིར་བར་ཡང་མི་འགྱུར་རོ། །
en: They have none of the sufferings of saṃsāra.

source: དེ་དག་འཁོར་བའི་སྡུག་བསྔལ་གྱིས་གོས་པར་ཡང་མི་འགྱུར་རོ། །
en: They are not stained by the afflictions of saṃsāra.

source: དུས་ཐམས་ཅད་དུ་མྱ་ངན་ལས་འདས་པ་ལ་སེམས་ཤིང་གནས་ཀྱི། །
en: They remain at all times in contemplation of nirvāṇa.

source: དེ་དག་གི་ལུས་ལ་གཞན་སེམས་པ་མེད་དོ། །
en: They have no other thought concerning their bodies.

source: རིགས་ཀྱི་བུ་དེ་འདས་ནས་སྨན་ཆེན་པོ་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཐོག་མ་བསྐྱེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་གནས་སོ།
en: “Noble son, beyond that there is the pore named Mahoṣadhī in which many millions of trillions of bodhisattvas live who have first developed bodhicitta.

source: རིགས་ཀྱི་བུ་བ་སྤུའི་ཁུང་བུ་དེ་ན་རི་དགུ་ཁྲི་ཡོད་དེ།
en: “Noble son, there are 99,000 mountains in that pore.

source: ལ་ལ་ནི་རྡོ་རྗེའི་རི། །
en: Some are made of diamonds,

source: ལ་ལ་ནི་དངུལ་གྱིའོ། །
en: some are made of silver,

source: ལ་ལ་ནི་གསེར་གྱིའོ།
en: some are made of gold,

source: ལ་ལ་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའིའོ། །
en: some are made of precious sapphire jewels,

source: ལ་ལ་ནི་པད་མ་རཱ་གའིའོ། །
en: some are made of rubies,

source: ལ་ལ་ནི་མ་ར་ཀ་ཏའིའོ། །
en: some are made of emeralds,

source: ལ་ལ་ནི་ཤེལ་གྱིའོ། །
en: and some are made of crystal.

source: རིའི་རྒྱལ་པོ་དེ་ལྟ་བུ་དག་ཡོད་དོ། །
en: Those kings of mountains are like that.

source: རི་རེ་རེ་ཞིང་ཡང་རྩེ་མོ་བརྒྱད་ཁྲི་ཡོད་དེ། །
en: Each one has eighty thousand peaks,

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། །
en: is adorned with various jewels,

source: ཤིན་ཏུ་མཛེས་པར་བྱས་པ་རྣམ་པ་སྣ་ཚོགས་པ་ཡིད་དུ་འོང་བ་དག་གོ།
en: and is extremely beautified by various delightful features.

source: རྩེ་མོ་དེ་དག་ལ་དྲི་ཟ་དག་གནས་ཏེ། དེ་དག་དུས་ཐམས་ཅད་དུ་བ་སྤུའི་ཁུང་བུ་ནས་སིལ་སྙན་འབྱུང་བ་འཛིན་ཏོ། །
en: “On the peaks there live gandharvas who continually play music, which emanates from that pore.

source: གང་སེམས་ཐོག་མ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་ལ་སེམས་ཏེ།
en: “Those bodhisattvas who have first developed bodhicitta contemplate emptiness and featurelessness.

source: ཞེས་དེ་ལྟ་བུའི་ལུས་ལ་སྐྱོ་བ་དག་བསམས་ནས་
en: They contemplate sadness concerning the body, thinking,

source: ཀྱེ་མའོ་སྡུག་བསྔལ་ལོ། །
en: ‘Alas, there is suffering:

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་སྡུག་བསྔལ་ལོ། །
en: the suffering of birth, aging, sickness, and death;

source: སྡུག་ཅིང་མཛའ་བ་དང་བྲལ་ཞིང་མི་སྡུག་ཅིང་མི་མཛའ་བ་དང་ཕྲད་པ་ནི་སྡུག་བསྔལ་ལོ།
en: the suffering of being separated from the beloved and pleasant; the suffering of encountering the disliked and unpleasant;

source: བསྟིར་མེད་པར་སྐྱེས་པ་ནི་སྡུག་བསྔལ་ལོ། །
en: the suffering of being born in Avīci;

source: ཐིག་ནག་པོ་འདེབས་པར་སྐྱེས་པ་ནི་སྡུག་བསྔལ་ལོ།
en: the suffering of being born in Kālasūtra;

source: སེམས་ཅན་ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་དུ་སྐྱེས་པ་རྣམས་ནི་སྡུག་བསྔལ་ལོ་
en: and the suffering of being born in the city of the pretas.’

source: དེའི་ཚེ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ།
en: At that time they are sitting cross-legged,

source: ལུས་དྲང་པོར་བསྲངས་ནས་དྲན་པ་མངོན་པར་བཞག་སྟེ་རི་དེ་དག་ལ་གནས་སོ།
en: their bodies straight, establishing themselves in focused mindfulness, dwelling in the mountains.

source: རིགས་ཀྱི་བུ་དེ་འདས་ནས་སྣ་ཚོགས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་རང་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་མ་གནས་ཏེ་དེ་དག་ནི་འབར་བ་དང་།
en: “Noble son, beyond that there is the pore named Cittarāja, in which live many millions of trillions of pratyekabuddhas.

source: གདུང་བ་དང་། ཆར་འབེབས་པ་དང་། གློག་གཏོང་བའི་ཆོ་འཕྲུལ་དག་བྱེད་དེ།
en: They perform miracles of fire, heat, rain, and lightning.

source: བ་སྤུའི་ཁུང་བུ་དེ་ན་རིའི་རྒྱལ་པོ་བརྒྱ་ཕྲག་སྟོང་དག་ཡོད་དོ། །
en: “Noble son, there are a hundred thousand mountains in that pore.

source: རིའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའོ། །
en: All those kings of mountains are made of the seven jewels.

source: རིའི་རྒྱལ་པོ་དེ་དག་ལ་ཤིང་དཔག་བསམ་རྣམ་པ་སྣ་ཚོགས་པར་ཡོད་དེ།
en: There are a variety of wish-granting trees on those kings of mountains.

source: རིན་པོ་ཆེ་རྣམ་པ་དུ་མ་དང་རྒྱན་རྣམ་པ་སྣ་ཚོགས་པ་དག་ནི་འཕྱང་ངོ་།
en: They are studded with a variety of jewels and hung with a variety of adornments.

source: ཅོད་པན་དང་། རྣ་ཆ་དང་། ཕྲེང་བའི་ཆུན་པོ་དང་། དཔུང་རྒྱན་དང་། སེ་མོ་དོ་དང་། སེ་མོ་དོ་ཕྱེད་པ་དག་ཀྱང་རབ་ཏུ་འཕྱང་ངོ་།
en: They are hung with diadems, earrings, garlands, armlets, and one hundred and eight-string and sixty-four-string pearl necklaces.

source: ཡུལ་ཀ་ཤི་ཀ་ནས་བྱུང་བའི་གོས་དག་ཀྱང་རབ་ཏུ་འཕྱང་ངོ་། །
en: They are hung with Kaśika cloth.

source: གསེར་དང་དངུལ་གྱི་དྲིལ་བུ་དག་ཀྱང་སྒྲ་སིལ་སིལ་གྲག་སྟེ། །
en: They have the jingling sounds of silver and gold bells.

source: དེ་འདྲ་བའི་རིའི་རྒྱལ་པོ་དེ་དག་ལ་རང་སངས་རྒྱས་དེ་དག་གནས་ཏེ། །
en: “Pratyekabuddhas live on these kings of mountains.

source: མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། རྟོགས་པ་བརྗོད་པ་དང་། དེ་ལྟ་བུ་འདས་པ་དང་། སྐྱེས་པའི་རབས་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། ཆོས་རྨད་དུ་བྱུང་བ་དང་། ཆོས་གཏན་ལ་དབབ་པ་བསྟན་པའི་གཏམ་རྣམ་པ་དུ་མ་དག་ཕན་ཚུན་དུ་སྨྲ་སྟེ།
en: They talk with each other about the sūtras, the geyas, the vyākaraṇas, the gāthās, the udānas, the nidānas, the avadānas, the itivṛttakas, the jātakas, the vaipulyas, the adbhūtadharmas, and the upadeśas.

source: དེའི་ཚེ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་བ་སྤུའི་ཁུང་བུ་དེ་འདས་ནས་ཐམས་ཅད་ཀྱི་ཐ་མ་ན་བ་སྤུའི་ཁུང་བུ་རྒྱལ་མཚན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Then, Sarva­nīvaraṇa­viṣkambhin, beyond that pore, last of all, there is the pore named Dhvajārāja.

source: བ་སྤུའི་ཁུང་བུ་དེ་ན་ཡང་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་དོ།
en: That pore is 84,000 yojanas wide.

source: བ་སྤུའི་ཁུང་བུ་དེ་ན་རི་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་དེ།
en: Within that pore there are 84,000 mountains,

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ཡིད་དུ་འོང་བ་རྣམ་པ་སྣ་ཚོགས་པའོ། །
en: beautifully adorned with a variety of jewels.

source: རིའི་རྒྱལ་པོ་དེ་ལ་ཤིང་དཔག་བསམ་བརྒྱ་ཕྲག་སྟོང་དུ་མ་ཡོད་དོ།
en: “On those kings of mountains, there are many hundreds of thousands of wish-fulfilling trees.

source: ཙན་དན་གྱི་ཤིང་བརྒྱ་ཕྲག་སྟོང་དུ་མ་ཡོད་དོ། །
en: There are many hundreds of thousands of sandalwood trees.

source: བྱི་རུའི་ཤིང་བརྒྱ་ཕྲག་སྟོང་དུ་མ་དག་ཡོད་དོ། །
en: There are hundreds of thousands of agarwood trees.

source: བ་སྤུའི་ཁུང་བུ་དེ་ནས་ནི་རྡོ་རྗེ་ལས་བྱས་པའོ། །
en: “Within that pore the ground is made of diamonds.

source: བ་སྤུའི་ཁུང་བུ་དེ་ན་གསེར་དང་རིན་པོ་ཆེ་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་མ་དགུ་ཁྲི་དགུ་སྟོང་ཡོད་དེ།
en: Within that pore there are many hundreds of thousands of ninety-nine-story palaces made of divine gold and jewels,

source: མུ་ཏིག་དང་དར་གྱི་ལྡ་ལྡི་ནི་བྲེས། མུ་ཏིག་གི་སེ་མོ་དོ་ནི་དཔྱངས། །
en: decorated with pearls, cloth, and garlands,

source: དྲིལ་བུའི་ཕྲེང་བ་ནི་དཔྱངས།
en: hung with strings of bells,

source: ཟླ་བ་བཞིན་དུ་བཟང་བའི་རིན་པོ་ཆེ་ས་ནི་སྣང་བར་བྱས་ཏེ།
en: and shining with moonstone gems.

source: ཁང་པ་བརྩེགས་མ་དེ་ན་གསེར་གྱི་སྐས་རིན་པོ་ཆེ་ས་ཡོངས་སུ་སྤྲས་པ་རྣམ་པ་སྣ་ཚོགས་པ་དགའ་བར་བྱེད་པ་དག་ཀྱང་ཡོད་དོ། །
en: “In those many-storied palaces, there are golden stairs beautified by delightful jewels of various kinds.
